#include <stdio.h>

int main() { 
    int num; // เก็บตัวเลขที่ผู้ใช้ป้อนเข้ามา
    int isPrime = 1; // จำนวนเฉพาะไว้กก่อน 1 = จริง 0 = เท็จ

    printf("Enter number:\n"); // พิมพ์ข้อความให้ผู้ใช้กรอกตัวเลข 
    scanf("%d", &num); // อ่านจำนวนเต็มจากคีย์บอร์ดเเละเก็บใน num

    if (num <= 1) { // ถ้าจำนวนน้อยกว่าหรือเท่ากับ 1
        isPrime = 0; // 0 เเละ  1 เเละตัวเลขติดลบไม่ถือเป็นจำนวนเฉพาะ
    } else {
        // วนตัวหารตั้งเเต่ 2 ถึง sqrt (num)
        // เงื่อนไข i * i <= num คือการตรวจสอบเเค่จนถึงรากที่สองของ num
        for (int i = 2; i * i <= num; i++) {
            if (num % i == 0) { // ถ้า num หารด้วย i ลงตัว
                isPrime = 0; // เเปลว่า num มีตัวประกอบอื่นนั่นคือไม่ใช่จำนวนเฉพาะ
                break; // หยุดการวนซ้ำทันทีเพราะไม่ใช่จำนวนเฉพาะ
            }
        }
    }

    if (isPrime) {
        printf("Pass.\n"); // ถ้า isPrime ยังเป็น 1 จริงเเสดงว่าเป็นจำนวนเฉพาะ
    } else {
        printf("Not Pass.\n"); // ไม่เป็นจำนวนเฉพาะ
    }

    return 0; // จบโปรเเกรม
}
