#include <stdio.h>

int main() {
    int n; // กำหนดตัวเเปร n

    printf("Enter number : "); // ใส่ตัวเลข
    scanf("%d", &n);// รับค่าจากผู้ใช้เเล้วเก็บไว้ในตัวเเปร n

    int i = n; // กำหนด ตัวเเปร i ให้เริ่มต้นที่ค่า n 

    while (i >= 2) { // ตรวจสอบว่า i เป็นจำนวนเฉพาะหรือไม่
        int j = 2;

        while (j < i) {
            if (i % j == 0) { // ถ้า i หารด้วย j ลงตัวเเสดงว่่ไม่ใช่จำนวนเฉพาะ
                break;
            }
            j++; // เพิ่มค่าตัวหาร
        }

        if (j == i) { // ถ้า j เท่ากับ i เเสดงว่าไม่มีตัวหารใดที่หาร i ลงตัวดังนั้น i เป็นจำนวนเฉพาะ
            printf("%d ", i); // เเสดงจำนวนเฉพาะ
        }

        i--; // ลดค่าของ i เพื่อไปตรวจสอบตัวเลขก่อนหน้้า
    }

    return 0; // จบโปรเเกรม
}
