#include <stdio.h>

int main() {
    int n; // กำหนดตัวเเปร
    printf("Enter number : "); //ใส่เลข
    scanf("%d", &n); // รับค่าจากผู้ใช้เเล้วเก็บไว้ในตัวเเปร n

    int i = n; // กำหนดตัวเเปร i ให้เริ่มต้นที่ค่า n

    do { // ลูปหลักทำงานหนึ่งครั้ง เเละวนจนกว่า i < 2 
        int j = 2; // ตัวหารที่ 2
        do { // ลูปย่อยเเบบตรวจสอบว่า i เป็นจำนวนเฉพาะหรือไม่
            if (i % j == 0) { // ถ้า i หารด้วย j ลงตัวเเสดงว่าไม่ใช่จำนวนเฉพาะ
                break; // ออกจากลูปย่อย
            }
            j++; //เพิ่มค่าตัวหาร
        } while (j < i); // ทำต่อไปจนกว่า j จะเท่ากับ i

        if (i >= 2 && j == i) { 
            printf("%d ", i); // เเสดงจำนวนเฉพาะ
        }

        i--; // ลดค่าของ i เพื่อไปตรวจสอบตัวเลขก่อนหน้า
    } while (i >= 2); // ทำต่อไปจนกว่า i จะน้อยกว่า 2

    return 0; // จบโปรเเกรม
}
