#include <stdio.h> 

int main() { //จุดเริ่มต้นโปรเเกรม
    int n; //สร้างตัวเเปร n
    printf("Enter number : "); //ใส่ตัวเลข
    scanf("%d", &n); // รับค่าตจากคีย์บอร์ดเเล้วเก็บไว้ใน n

    for (int i = n; i >= 2; i--) { //ไล่ตรวจเลขตั้งเเต่ n ลงทาถึง 2 เพราะ 0 กับ 1 ไม่ใช่จำนวนเฉพาะ
        int j; // เอา j ไปหารที่ละตัว
        for (j = 2; j < i; j++) { //เอา i ไปหารด้วย j ตั้งเเต่ 2 จนถึง i-1
            if (i % j == 0) {
                break; //ไม่ใช่จำนวนเฉพาะจะหยุดเช็ค
            }
        }
        if (j == i) { //ถ้าลูปย่อยวิ่งจน j ถึง i ได้ เเปลว่าไม่เจอตัวหาร
            printf("%d ", i); // i เป็นจำนวนเฉพาะ
        }
    }

    return 0; //จบโปรเเกรม
}
